БухЭксп/InformationRegisters/CW_СтатусыПланированиеДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатусыПланированиеДДС</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыПланированияДДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПланированиеДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПланированиеДДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_СтатусыПланированияДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СтатусыПланированияДДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СтатусыПланированиеДДС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаписатьСтатусВРегистр(ПланированиеДДС, Статус) Экспорт
	
	Отбор =  Новый Структура("ПланированиеДДС", ПланированиеДДС);
	СтруктураСтатуса = РегистрыСведений.CW_СтатусыПланированиеДДС.ПолучитьПоследнее(ТекущаяДата(), Отбор);
	
	Если СтруктураСтатуса.Статус <> Статус Тогда
		
		ЗаписьРегистра = РегистрыСведений.CW_СтатусыПланированиеДДС.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Период = ТекущаяДата();
		ЗаписьРегистра.ПланированиеДДС = ПланированиеДДС;
		ЗаписьРегистра.Статус = Статус;
		
		ЗаписьРегистра.Записать(истина);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтатусПланированияДДС(ПланированиеДДС, ДатаСреза=Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаСреза) Тогда
		ДатаСреза = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СтатусыПланированиеДДССрезПоследних.ПланированиеДДС КАК ПланированиеДДС,
	               |	CW_СтатусыПланированиеДДССрезПоследних.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.CW_СтатусыПланированиеДДС.СрезПоследних(&ДатаСреза, ПланированиеДДС = &ПланированиеДДС) КАК CW_СтатусыПланированиеДДССрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", 			ДатаСреза);
	Запрос.УстановитьПараметр("ПланированиеДДС", 	ПланированиеДДС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Статус;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.План");
	
КонецФункции

#КонецЕсли
